emacs_tutorial.html
<!doctype html>
<html lang="en">
<head>
<title>Emacs setup and configuration</title>
<!-- 2022-09-28 Wed 19:52 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="ivan">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-3 col-md-push-9"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-1">1. Running emacs in a terminal:</a>
<ul class="nav">
<li><a href="#sec-1-1">1.1. Windows and frames concept</a></li>
<li><a href="#sec-1-2">1.2. Buffers</a></li>
<li><a href="#sec-1-3">1.3. The Mode line</a></li>
<li><a href="#sec-1-4">1.4. Echo are and a minibuffer</a></li>
<li><a href="#sec-1-5">1.5. Commands in emacs</a></li>
<li><a href="#sec-1-6">1.6. Major and minor modes</a></li>
<li><a href="#sec-1-7">1.7. Opening and saving files</a></li>
<li><a href="#sec-1-8">1.8. Switching buffers</a></li>
<li><a href="#sec-1-9">1.9. Cut and copy text</a></li>
<li><a href="#sec-1-10">1.10. CUA mode</a></li>
<li><a href="#sec-1-11">1.11. Undo and redo</a></li>
<li><a href="#sec-1-12">1.12. Cancelling operations</a></li>
<li><a href="#sec-1-13">1.13. Describe bindings</a></li>
<li><a href="#sec-1-14">1.14. Help system</a></li>
<li><a href="#sec-1-15">1.15. Configuring emacs</a></li>
</ul>
</li>
</ul>
</div>
</nav>
</div><div class="col-md-9 col-md-pull-3"><h1 class="title">Emacs setup and configuration</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Running emacs in a terminal:</h2>
<div class="outline-text-2" id="text-1">
<p>
Launch: <code>emacs -Q -nw</code>
F10 key shows the terminal mode menu for emacs
</p>
<ul class="org-ul">
<li>no file tree.. However community packages can be added for file management
</li>
</ul>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Windows and frames concept</h3>
<div class="outline-text-3" id="text-1-1">
<p>
In 'Emacs' window is a pane inside current emacs window. 
Windows can be splitted. Emacs frame is your current workspace. Keybinding <code>C-x 5 2</code> creates a new frame.
You can use mutiple frames i.e. while using it as your desktop environment. 
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Buffers</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Buffer is an object that holds information to be displayed, store logs, messagess etc. 
The latter are special buffers. Buffer can be used to create an interface.
<code>M-x global-tab-line-mode</code> can be used to turn on the tab interface to display all active buffers at once. <i>If the package is installed.</i>
But it's better to use buffers management commands. <code>C-x b</code> brings up a buffer lists and you can switch between them.
</p>
</div>
<div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> Special buffers:</h4>
<div class="outline-text-4" id="text-1-2-1">
<ul class="org-ul">
<li><b>scratch</b> buffer
</li>
</ul>
<p>
Blank page for temporary notes or copy text that's not needed to be saved.
You can use elisp code there too.
</p>
<ul class="org-ul">
<li><b>Messages</b> buffer
</li>
</ul>
<p>
Is a messages log that contains all messages. 
</p>
<ul class="org-ul">
<li><b>Warnings</b> buffer
</li>
</ul>
<p>
Shows potential errors (e.g. from packages). Something to keep in mind.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> The Mode line</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Gives information about current state of the editor. 
It can show current git branch that's being used at the moment. 
There is only one mode line per window inside emacs.
</p>

<p>
Emacs is fully customizable, so try differemt mode line packages.
</p>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Echo are and a minibuffer</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Line where messages get written at the bottom of the screen.
Shows transient information. 
Minibuffer is another temporary interaction space. Promts for commands etc.
It can be multiple line too. 
</p>
</div>
</div>

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> Commands in emacs</h3>
<div class="outline-text-3" id="text-1-5">
<p>
Commands are used for editing, 
To run a command hit a keybinding: <code>M-x</code> and type <code>command</code>. Press <code>Tab</code> for autocompletion.
Many commands have prefixes with particular concepts, that helps in completions within certain subsets.
</p>
</div>

<div id="outline-container-sec-1-5-1" class="outline-4">
<h4 id="sec-1-5-1"><span class="section-number-4">1.5.1</span> Some useful commands:</h4>
<div class="outline-text-4" id="text-1-5-1">
<ul class="org-ul">
<li>dired &#x2013; does file listings, director browser inside emacs. Shows the <code>ls -lah</code> output.
</li>
<li>show calendar <code>M-x calendar</code>
</li>
<li>built-in shell <code>M-x eshell</code> 
</li>
</ul>
<p>
Embedded shell emulates batch because it's written in elisp.
</p>
<ul class="org-ul">
<li>tetris <code>M-x tetris</code>
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> Major and minor modes</h3>
<div class="outline-text-3" id="text-1-6">
</div><div id="outline-container-sec-1-6-1" class="outline-4">
<h4 id="sec-1-6-1"><span class="section-number-4">1.6.1</span> Major mode</h4>
<div class="outline-text-4" id="text-1-6-1">
<p>
Depending on the file extension emacs activates the particular functionality to work with these files.
Major mode provides functionality for a particular buffer (org mode, python mode,&#x2026;). 
Turns on the syntax highliting too.
Core functionality for a specific buffer. Major modes are activated with special commands.
E.g. <code>M-x org-mode</code> tuns major mode for <i>.org</i> files.
Fundamental moe is one without any special functionality included.
</p>
</div>
</div>

<div id="outline-container-sec-1-6-2" class="outline-4">
<h4 id="sec-1-6-2"><span class="section-number-4">1.6.2</span> Minor mode</h4>
<div class="outline-text-4" id="text-1-6-2">
<p>
Works globally across emacs. E.g. if you need to customize your workflow, then third-party packages provide this functonality you need.
For instance <code>hl-line-mode</code> that highlits current line. Switching to another buffer turns this mode off. Minor mode works only in one buffer, 
but some of them can work globally too. 
</p>
</div>
</div>

<div id="outline-container-sec-1-6-3" class="outline-4">
<h4 id="sec-1-6-3"><span class="section-number-4">1.6.3</span> Basic Key bindings</h4>
<div class="outline-text-4" id="text-1-6-3">
<p>
Bindings are completely flexible and customizable.
The syntax is a litlle bit peculiar:
</p>
<ul class="org-ul">
<li><code>C-x C-s</code> Hold Ctrl and press 'x' and then 's' still holdind Ctrl.
</li>
<li><code>C-x b</code> Release Ctrl and press 'b'
</li>
</ul>
<p>
Single letters can be interpreted as follows:
</p>

<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="left">

<col  class="left">
</colgroup>
<thead>
<tr>
<th scope="col" class="text-left">Letter</th>
<th scope="col" class="text-left">Key</th>
</tr>
</thead>
<tbody>
<tr>
<td class="text-left">C</td>
<td class="text-left">Ctrl</td>
</tr>

<tr>
<td class="text-left">M</td>
<td class="text-left">Alt (Meta)</td>
</tr>

<tr>
<td class="text-left">S</td>
<td class="text-left">Shift</td>
</tr>

<tr>
<td class="text-left">s</td>
<td class="text-left">Super</td>
</tr>
</tbody>
</table>

<p>
Prefixes:
</p>
<ul class="org-ul">
<li><code>C-x</code> prefix for all emacs primary key bindings
</li>
<li><code>C-c</code> keybindings for current major mode. It also can be used for user defined keybindigs.
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-1-7" class="outline-3">
<h3 id="sec-1-7"><span class="section-number-3">1.7</span> Opening and saving files</h3>
<div class="outline-text-3" id="text-1-7">
<p>
Basic file operations:
<code>C-x C-f</code> to open a file (find-file). 
<code>C-x C-s</code> to save a file
Save current buffer to another location (Save as..)
<code>C-x C-w</code> to write a file
</p>
</div>
</div>

<div id="outline-container-sec-1-8" class="outline-3">
<h3 id="sec-1-8"><span class="section-number-3">1.8</span> Switching buffers</h3>
<div class="outline-text-3" id="text-1-8">
<p>
<code>C-x b</code> switch to a particular buffer.
<code>C-x C-b</code> list all buffers
<code>C-x left/right arrow</code> switch between buffer chain (next/previous)
</p>
</div>
</div>

<div id="outline-container-sec-1-9" class="outline-3">
<h3 id="sec-1-9"><span class="section-number-3">1.9</span> Cut and copy text</h3>
<div class="outline-text-3" id="text-1-9">
<p>
To kill (copy-delete) text
</p>
<ol class="org-ol">
<li>Mark the region using <code>C-Space</code>
</li>
<li>Hit <code>C-w</code> to delete and copy the text into a kill ring
</li>
<li>Yank (paste) text with <code>C-y</code>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-10" class="outline-3">
<h3 id="sec-1-10"><span class="section-number-3">1.10</span> CUA mode</h3>
<div class="outline-text-3" id="text-1-10">
<p>
Activates conventional keybindings <code>C-c</code>, <code>C-v</code>.
</p>
</div>
</div>

<div id="outline-container-sec-1-11" class="outline-3">
<h3 id="sec-1-11"><span class="section-number-3">1.11</span> Undo and redo</h3>
<div class="outline-text-3" id="text-1-11">
<p>
<code>C-/</code> to undo (<code>C-_</code> by default)
<code>C-g C-/</code> to inverse undo direction
</p>
</div>
</div>

<div id="outline-container-sec-1-12" class="outline-3">
<h3 id="sec-1-12"><span class="section-number-3">1.12</span> Cancelling operations</h3>
<div class="outline-text-3" id="text-1-12">
<p>
E.g. cancels operation before it completes.
<code>C-g</code> cancels command and brings you back into editing.
Keeps you out of a jam in a lot of cases.
</p>
</div>
</div>

<div id="outline-container-sec-1-13" class="outline-3">
<h3 id="sec-1-13"><span class="section-number-3">1.13</span> Describe bindings</h3>
<div class="outline-text-3" id="text-1-13">
<p>
<code>M-x describe-bindings</code>
<code>M-x describe-key</code> or <code>C-h k</code>
</p>
</div>
</div>

<div id="outline-container-sec-1-14" class="outline-3">
<h3 id="sec-1-14"><span class="section-number-3">1.14</span> Help system</h3>
<div class="outline-text-3" id="text-1-14">
<p>
Emacs manual is built in, and you can navigate through it.
You can simply go to <i>Help</i> menu. 
</p>
</div>
</div>

<div id="outline-container-sec-1-15" class="outline-3">
<h3 id="sec-1-15"><span class="section-number-3">1.15</span> Configuring emacs</h3>
<div class="outline-text-3" id="text-1-15">
<ol class="org-ol">
<li>Customization UI
</li>
</ol>
<p>
To get there type <code>M-x customize</code>
</p>
<ol class="org-ol">
<li><code>init.el</code> file
</li>
</ol>
<p>
Actual emacs lisp code to configure emacs. You can define your own functions too.
You can then share it between machines.
</p>
</div>
</div>
</div>
</div></div></div>
<footer id="postamble" class="">
<div><p class="author">Author: ivan</p>
<p class="date">Created: 2022-09-28 Wed 19:52</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 26.3 (<a href="http://orgmode.org">Org-mode</a> 9.1.9)</p>
</div>
</footer>
</body>
</html>
